# YOLOv9

# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
#activation: nn.LeakyReLU(0.1)
#activation: nn.ReLU()

# anchors
anchors: 3

# gelan backbone
backbone:
  [
   [-1, 1, Silence, []],  
   
   # conv down
   [-1, 1, Conv, [32, 3, 2]],  # 1-P1/2

   # conv down
   [-1, 1, DualConv2, [64, 2]],  # 2-P2/4 #################

   # elan-1 block
   [-1, 1, RepNCSPELAN4, [128, 128, 64, 1]],  # 3

   # avg-conv down
   [-1, 1, AConv, [240]],  # 4-P3/8

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [240, 240, 120, 1]],  # 5

   # avg-conv down
   [-1, 1, AConv, [360]],  # 6-P4/16

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [360, 360, 180, 1]],  # 7

   # avg-conv down
   [-1, 1, AConv, [480]],  # 8-P5/32

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [480, 480, 240, 1]],  # 9
  ]

# elan head
head:
  [
   # elan-spp block
   [-1, 1, SPPELAN, [480, 240]],  # 10

   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 11
   [[-1, 7], 1, Concat, [1]],  # 12 cat backbone P4
   [-1, 2, C2fRepCIB, [840,True]], # 13 #################################

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [360, 360, 180, 1]],  # 14

   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 15
   [[-1, 5], 1, Concat, [1]],  # 16 cat backbone P3
   [-1, 2, C2fRepCIB, [600,True]],  # 17 #############################

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [240, 240, 120, 1]],  # 18

   # avg-conv-down merge
   [-1, 1, AConv, [180]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [360, 360, 180, 1]],  # 21 (P4/16-medium)

   # avg-conv-down merge
   [-1, 1, AConv, [240]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [480, 480, 240, 1]],  # 24 (P5/32-large)
   
   # routing
   [5, 1, CBLinear, [[240]]], # 25
   [7, 1, CBLinear, [[240, 360]]], # 26
   [9, 1, CBLinear, [[240, 360, 480]]], # 27
   
   # conv down
   [0, 1, Conv, [32, 3, 2]],  # 28-P1/2

   # conv down
   [-1, 1, DualConv2, [64, 2]],  # 29-P2/4

   # elan-1 block
   [-1, 1, RepNCSPELAN4, [128, 128, 64, 1]],  # 30

   # avg-conv down
   [-1, 1, AConv, [240]],   # 31-P3/8
   [[25, 26, 27, -1], 1, CBFuse, [[0, 0, 0]]], # 32

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [240, 240, 120, 1]],  # 33

   # avg-conv down
   [-1, 1, AConv, [360]],   # 34-P4/16
   [[26, 27, -1], 1, CBFuse, [[1, 1]]], # 35

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [360, 360, 180, 1]],  # 36

   # avg-conv down
   [-1, 1, AConv, [480]],   # 35-P5/32
   [[27, -1], 1, CBFuse, [[2]]], # 38

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [480, 480, 240, 1]],  # 39

   # detect
   [[33, 36, 39, 18, 21, 24], 1, DualDDetect, [nc]],  # Detect(P3, P4, P5)
  ]
